/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: toshota <toshota@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/09 16:04:21 by toshota           #+#    #+#             */
/*   Updated: 2023/10/09 16:19:38 by toshota          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int main(int argc, char **argv)
{
	//	引数が適切であるかをチェックする
	//	ソートする
}
/*

1．12個のルールをつくる
2．引数が適切であるかをチェックする
3．ルールをもとにクイックソートをする

1．12個のルールをつくる
──
1．双方好循環リストを理解する
2．双方好循環リストを用いて12個ルールをつくる

2．引数が適切であるかをチェックする
──
1．値が文字列でないかをチェックする
2．値がint型であるかをチェックする
3．値に重複がないかをチェックする

3．ルールをもとにクイックソートをする
──
1．クイックソートを理解する
2．2つのスタックを用いてクイックソートをつくる

 */
