/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   get_data.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: toshota <toshota@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/10 17:24:49 by toshota           #+#    #+#             */
/*   Updated: 2023/10/12 15:26:12 by toshota          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../inc/get_data.h"

void	get_data(char **argv, t_data *data)
{
	exit_with_error();
	// データ（数字）が文字列でないかをチェックする（個々のコマンドライン引数に格納されている値が+,-,0,1,2,3,4,5,6,7,8,9のいずれかで構成されているかを調べる）

	// データが+，-のみでないかを調べる
	// 個々のコマンドライン引数に格納されている値をリストに代入する
}
