/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   get_data.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: toshota <toshota@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/10 17:24:49 by toshota           #+#    #+#             */
/*   Updated: 2023/10/13 15:10:38 by toshota          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../inc/get_data.h"

void	get_data(int argc, char **argv, t_data *data)
{
	// コマンドライン引数をチェックする
	check_arg(argc, argv + 1);
	// 個々のコマンドライン引数に格納されている値をリストに代入する
	// get_data_from_argv(argv, data);
}
